ezois_ka/oooezoiskaobmen.vssoft_ka_ooo_ezois/src/Reports/vs_МатериальныйОтчет_2023/vs_МатериальныйОтчет_2023.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Report>
  <name>vs_МатериальныйОтчет_2023</name>
  <attributes>
    <name>ФормироватьДокументы</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>СкладЦеха</name>
    <type>
      <types>CatalogRef.Склады</types>
    </type>
  </attributes>
</mdclass:Report>

ezois_ka/oooezoiskaobmen.vssoft_ka_ooo_ezois/src/AccumulationRegisters/ТоварыНаСкладах/ТоварыНаСкладах.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="80440cbb-f97b-4620-8eca-b89f9a033f08">
  <name>ТоварыНаСкладах</name>
  <objectBelonging>Adopted</objectBelonging>
  <extension>
    <registerType>Checked</registerType>
  </extension>
  <resources extendedConfigurationObject="2d1fe73e-1f3d-4ee9-9dd1-010dfff742b1">
    <name>ВНаличии</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </resources>
  <resources extendedConfigurationObject="d7a580fb-b3d4-4540-9057-2bf42dbcce49">
    <name>КОтгрузке</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </resources>
  <dimensions extendedConfigurationObject="70b08d50-30e9-4115-9e39-67ef989c58b2">
    <name>Номенклатура</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions extendedConfigurationObject="c9fd5a1a-3aa5-4048-b15e-f8b6a41ab96f">
    <name>Характеристика</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions extendedConfigurationObject="cc2a9ed0-e83e-4ca4-a99c-1b3eefba4d77">
    <name>Назначение</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions extendedConfigurationObject="29d5a4e7-4544-4ed2-a8bf-d541eef13703">
    <name>Склад</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions extendedConfigurationObject="32c528cc-88fa-48ca-967d-eb0035bcc3a8">
    <name>Серия</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
</mdclass:AccumulationRegister>

ezois_ka/oooezoiskaobmen.vssoft_ka_ooo_ezois/src/Enums/ХозяйственныеОперации/ХозяйственныеОперации.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="351b0c5b-74c3-4aaa-a93b-7246b941f797">
  <name>ХозяйственныеОперации</name>
  <objectBelonging>Adopted</objectBelonging>
  <enumValues extendedConfigurationObject="1e18177a-fe02-4999-a369-fb008fe9fd42">
    <name>ПеречислениеВБюджет</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="692215c8-f484-4e22-b24f-430cd2009fae">
    <name>ОплатаДенежныхСредствВДругуюОрганизацию</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="95818758-8542-4405-8773-6b644d757e22">
    <name>ВыдачаДенежныхСредствПодотчетнику</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="1879ad4f-47e1-438b-9738-f1429bc3c780">
    <name>ПеречислениеТаможне</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="da785c97-98fb-4ee6-8990-f175fe8496ef">
    <name>КонвертацияВалюты</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="b5771beb-5568-450d-963a-bfe9090b7f8c">
    <name>ВыдачаЗаймов</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="1923f574-7981-46df-b96d-b293c2f88d8c">
    <name>ОплатаПоставщику</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="a07305c5-0d5c-4195-8220-2eb29fa05ef5">
    <name>ВнутренняяПередачаДенежныхСредств</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="d0e70b4c-e687-4b56-a586-c641aa8d81ae">
    <name>ВыплатаЗарплаты</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="2d869152-e27f-4d56-a690-de6ac662ace2">
    <name>ОплатаПоКредитам</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="572c15b7-b781-43a9-91fb-eecc7ecffee8">
    <name>ПеречислениеНаДепозиты</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="6915db6f-cc8d-4766-aca9-84cf48edcd58">
    <name>ВыдачаЗаймаСотруднику</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="693adf02-fccb-4cd9-a092-f9fa532b7983">
    <name>ПрочаяВыдачаДенежныхСредств</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="724dc975-c8d5-4eea-b4af-52c1b39555e5">
    <name>ВозвратОплатыКлиенту</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="51ad2381-0d1f-4a17-823e-32dfa2be2232">
    <name>ВозвратДенежныхСредствВДругуюОрганизацию</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="b4199927-65e9-4e54-90f9-456e4c68a93f">
    <name>ВыплатаЗарплатыПоЗарплатномуПроекту</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="6d079ef6-b405-487d-9ff8-d6cbe795713f">
    <name>ВыплатаЗарплатыНаЛицевыеСчета</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="240b34c3-b18a-47c5-9f2f-bd241e23e42a">
    <name>ВыплатаЗарплатыЧерезКассу</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="aee89418-2c06-47ad-bf28-064f762e59aa">
    <name>ВозвратОплатыНаПлатежнуюКарту</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="15ce947b-5b8c-4087-b372-2f3f60dedd76">
    <name>ОплатаАрендодателю</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="82e6dbf8-d7ba-4382-9880-9e83d175a158">
    <name>СписаниеТоваровПоТребованию</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="f675a52b-940a-480e-8374-c64ff49e4478">
    <name>СборкаТоваров</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="ad2322ce-9ed5-4e79-ace7-6f03b97d9445">
    <name>РазборкаТоваров</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
</mdclass:Enum>

ezois_ka/oooezoiskaobmen.vssoft_ka_ooo_ezois/src/Documents/ВнутреннееПотребление/ВнутреннееПотребление.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="b726b4a4-d691-4fa0-bef7-e6f1bd056cbf">
  <name>ВнутреннееПотребление</name>
  <objectBelonging>Adopted</objectBelonging>
  <registerRecords>AccumulationRegister.vs_Доизготовление</registerRecords>
  <registerRecords>AccumulationRegister.ИТБК_Доизготовление</registerRecords>
  <attributes>
    <name>vs_СтатьяРасходов</name>
    <type>
      <types>ChartOfCharacteristicTypesRef.СтатьиРасходов</types>
      <types>ChartOfCharacteristicTypesRef.СтатьиАктивовПассивов</types>
    </type>
  </attributes>
  <attributes extendedConfigurationObject="8f13106d-31d1-441b-8330-ef025f55fdbf">
    <name>ЗаказНаВнутреннееПотребление</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="7bab1076-c626-4662-b814-ed3a1973efb8">
    <name>СторнируемыйДокумент</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="e12d08bd-1d79-40a7-b21c-f669b1a7094b">
    <name>ДокументОснование</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="930f6e33-ad27-42aa-847a-055d575b4e7a">
    <name>ИТБК_АктИзготовления</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>vs_АктИзготовления</name>
    <type>
      <types>DocumentRef.ЗаказНаСборку</types>
      <types>DocumentRef.СборкаТоваров</types>
    </type>
  </attributes>
  <attributes>
    <name>vs_ЭтоДоизготовление</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>vs_Статус</name>
    <type>
      <types>EnumRef.СтатусыСборокТоваров</types>
    </type>
  </attributes>
  <attributes extendedConfigurationObject="6ac93f4f-ec62-46e7-b4ca-38e795bf02db">
    <name>Организация</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="4e50af2f-d7e6-4349-bd07-de9f379b59ea">
    <name>Подразделение</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="9bf2417c-ed59-4c71-a254-2f2338f41425">
    <name>Склад</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="22ea815e-ceda-4730-8b5e-62907ac780b9">
    <name>ХозяйственнаяОперация</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <tabularSections extendedConfigurationObject="385ab3ce-dd41-4c25-b89b-974bb478f380">
    <name>Товары</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes extendedConfigurationObject="0da3af76-0f90-43fc-bf8d-6d86f1169900">
      <name>АналитикаРасходов</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="a7dbbbcd-b6fb-4d47-96b7-edcd8cf2d437">
      <name>Назначение</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="3dc4c4e8-1141-4c3c-95fd-9a8722f0d2d8">
      <name>ЗаказНаВнутреннееПотребление</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>vs_Доизготовление</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Характеристика</name>
      <type>
        <types>CatalogRef.ХарактеристикиНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>Серия</name>
      <type>
        <types>CatalogRef.СерииНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>СтатьяРасходов</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.СтатьиРасходов</types>
        <types>ChartOfCharacteristicTypesRef.СтатьиАктивовПассивов</types>
      </type>
    </attributes>
    <attributes>
      <name>ТребуетсяДоизготовить</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Отказ</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>АналитикаРасходов</name>
      <type>
        <types>Characteristic.СтатьиРасходов</types>
      </type>
    </attributes>
    <attributes>
      <name>Назначение</name>
      <type>
        <types>CatalogRef.Назначения</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

ezois_ka/oooezoiskaobmen.vssoft_ka_ooo_ezois/src/Documents/СборкаТоваров/СборкаТоваров.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="600ea876-962e-4c78-bacb-7368e2d7bd87">
  <name>СборкаТоваров</name>
  <objectBelonging>Adopted</objectBelonging>
  <registerRecords>AccumulationRegister.vs_Доизготовление</registerRecords>
  <registerRecords>AccumulationRegister.ИТБК_Доизготовление</registerRecords>
  <attributes extendedConfigurationObject="e7d6af32-9bc6-40c2-b3f1-f5d16ad67df9">
    <name>СторнируемыйДокумент</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="660a4c7d-a983-455d-8258-5307371c13f8">
    <name>ЗаказНаСборку</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="b16013d8-0227-4894-95d4-41b953964e2b">
    <name>Назначение</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>vs_АктИзготовления</name>
    <type>
      <types>DocumentRef.ЗаказНаСборку</types>
      <types>DocumentRef.СборкаТоваров</types>
    </type>
  </attributes>
  <attributes>
    <name>ПлановаяСтоимость</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СуммаПлановая</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <tabularSections extendedConfigurationObject="52b01363-8774-4cb2-a192-b4017c48be6b">
    <name>Товары</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes extendedConfigurationObject="a25e3b0c-2647-4c12-aa53-991fe77955a6">
      <name>Назначение</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>vs_Доизготовить</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Характеристика</name>
      <type>
        <types>CatalogRef.ХарактеристикиНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

ezois_ka/oooezoiskaobmen.vssoft_ka_ooo_ezois/src/Reports/vs_МатериальныйОтчет_2023/ObjectModule.bsl
//Функция СведенияОВнешнейОбработке() Экспорт
//	
//    ПараметрыРегистрации = ДополнительныеОтчетыИОбработки.СведенияОВнешнейОбработке("1.0.0.1");
//    ПараметрыРегистрации.Вид = ДополнительныеОтчетыИОбработкиКлиентСервер.ВидОбработкиДополнительныйОтчет();
//    ПараметрыРегистрации.Версия = "1.0";
//	ПараметрыРегистрации.Вставить("БезопасныйРежим", Ложь);  	
//	НоваяКоманда = ПараметрыРегистрации.Команды.Добавить();
//    НоваяКоманда.Представление = "Материальный отчет (ВЕД)";
//    НоваяКоманда.Идентификатор = "МатериальныйОтчетВЕД";
//    НоваяКоманда.Использование = ДополнительныеОтчетыИОбработкиКлиентСервер.ТипКомандыОткрытиеФормы();
//	
//	Возврат ПараметрыРегистрации;
//	
//КонецФункции

Процедура ПриКомпоновкеРезультата(ДокументРезультат, ДанныеРасшифровки, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	ДокументРезультат.Очистить();
	
	// Применяем пользовательские настройки
	КомпоновщикНастроек.ЗагрузитьНастройки(КомпоновщикНастроек.ПолучитьНастройки());
	
	НастройкиКД = КомпоновщикНастроек.Настройки;
	ПараметрыДанных = КомпоновщикНастроек.Настройки.ПараметрыДанных;
	
	// Читаем параметры отчета
	ПериодОтчета  = ПараметрыДанных.НайтиЗначениеПараметра(Новый ПараметрКомпоновкиДанных("Период")).Значение;
	ДатаНачала    = ПериодОтчета.ДатаНачала;
	ДатаОкончания = ПериодОтчета.ДатаОкончания;
	
	
	
		
	ПараметрДанных = КомпоновщикНастроек.Настройки.ПараметрыДанных.Элементы.Найти("Склад1");
	ПараметрДанных.Значение = Справочники.Склады.НайтиПоНаименованию("Цех № 1", Истина);
	ПараметрДанных.Использование=Истина;
	
	
	
	ГотоваяПродукция      = ПараметрыДанных.НайтиЗначениеПараметра(Новый ПараметрКомпоновкиДанных("ГотоваяПродукция")).Значение;
	ГотоваяПродукция      = ?(ЗначениеЗаполнено(ГотоваяПродукция), ГотоваяПродукция, Справочники.Номенклатура.НайтиПоНаименованию("ГП", Истина));
	
	СтатьяРасходов	      = ПараметрыДанных.НайтиЗначениеПараметра(Новый ПараметрКомпоновкиДанных("СтатьяРасходов")).Значение;
	СтатьяРасходов        = ?(ЗначениеЗаполнено(СтатьяРасходов), СтатьяРасходов, ПланыВидовХарактеристик.СтатьиРасходов.НайтиПоНаименованию("!!! Списание на расходы", Истина));
	
	СборкаИзКомплектующих = ПараметрыДанных.НайтиЗначениеПараметра(Новый ПараметрКомпоновкиДанных("СборкаИзКомплектующих")).Значение;
	СборкаИзКомплектующих = ?(ЗначениеЗаполнено(СборкаИзКомплектующих), СборкаИзКомплектующих, Перечисления.ХозяйственныеОперации.СборкаТоваров);
	
	Запрос = Новый Запрос();
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	Запрос.УстановитьПараметр("ДатаНачала"           , Новый Граница(ДатаНачала, Видграницы.Включая));
	Запрос.УстановитьПараметр("ДатаОкончания"        , Новый Граница(ДатаОкончания, Видграницы.Включая));
	Запрос.УстановитьПараметр("ГотоваяПродукция"     , ГотоваяПродукция);
	Запрос.УстановитьПараметр("СборкаИзКомплектующих", СборкаИзКомплектующих);
	Запрос.УстановитьПараметр("Наименование", "%(АИ)%");
	ДопизготовлениеПроизводство = Новый Массив();
	ДопизготовлениеПроизводство.Добавить(Новый ПланВидовХарактеристикСсылка.СтатьиРасходов(Новый УникальныйИдентификатор("4e86c433-5bf1-11eb-ab3f-00155d439817")));
	ДопизготовлениеПроизводство.Добавить(Новый ПланВидовХарактеристикСсылка.СтатьиРасходов(Новый УникальныйИдентификатор("fc8bf825-6139-11eb-ab40-00155d439817")));
	Запрос.УстановитьПараметр("ДопизготовлениеПроизводство", ДопизготовлениеПроизводство);
		
	// Читаем данные
	//ТабВыпускПродукции = Отчеты.ИТБК_МатериальныйОтчет.ПолучитьВыпускПродукции(ДатаНачала, ДатаОкончания, ГотоваяПродукция, СборкаИзКомплектующих); 
	//ТабВыпускПродукции = ПолучитьВыпускПродукции(Запрос, ДатаНачала, ДатаОкончания, ГотоваяПродукция, СборкаИзКомплектующих);	//всг+
	//ТабЗатратыНаСборку = Отчеты.ИТБК_МатериальныйОтчет.ПолучитьЗатратыНаСборку(ДатаНачала, ДатаОкончания, ГотоваяПродукция, СтатьяРасходов);
	//ТабЗатратыНаСборку = ПолучитьЗатратыНаСборку(Запрос, ДатаНачала, ДатаОкончания, ГотоваяПродукция, СтатьяРасходов);   //всг+
	
	Запрос.Текст = ПолучитьТекстВыпускПродукцииЗатратыНаСборку();
	Пакет = Запрос.ВыполнитьПакетСПромежуточнымиДанными();
	ТабВыпускПродукции 		= Пакет[0].Выгрузить();
	ТабВыпускПродукции.Колонки.Добавить("ВидОперации");
	ТабВыпускПродукции.ЗаполнитьЗначения("Сборка", "ВидОперации");

	МассивУзловАИ      		= Пакет[1].Выгрузить().ВыгрузитьКолонку("Ссылка");
	
	ТаблицаПродукцииРазбор 	= Пакет[3].Выгрузить();
	ТаблицаПродукцииРазбор.Колонки.Добавить("ЭтоЭлемент", Новый ОписаниеТипов("Булево"));
	ТаблицаПродукцииРазбор.Колонки.Добавить("Обработано", Новый ОписаниеТипов("Булево"));
	ТаблицаПродукцииРазбор.Колонки.Добавить("ЭтоАИ", Новый ОписаниеТипов("Булево"));
	ТаблицаПродукцииРазбор.Колонки.Добавить("СкладАИ", Новый ОписаниеТипов("СправочникСсылка.Склады"));

	ТаблицаПродукцииТЗРазобрано = Новый ТаблицаЗначений;
	ТаблицаПродукцииТЗРазобрано.Колонки.Добавить("Номенклатура", 	Новый ОписаниеТипов("СправочникСсылка.Номенклатура"));
	ТаблицаПродукцииТЗРазобрано.Колонки.Добавить("Характеристика", 	Новый ОписаниеТипов("СправочникСсылка.ХарактеристикиНоменклатуры"));
	ТаблицаПродукцииТЗРазобрано.Колонки.Добавить("Серия", 			Новый ОписаниеТипов("СправочникСсылка.СерииНоменклатуры"));
	ТаблицаПродукцииТЗРазобрано.Колонки.Добавить("Склад", 			Новый ОписаниеТипов("СправочникСсылка.Склады"));
	ТаблицаПродукцииТЗРазобрано.Колонки.Добавить("Назначение", 		Новый ОписаниеТипов("СправочникСсылка.Назначения"));
	ТаблицаПродукцииТЗРазобрано.Колонки.Добавить("Количество", 		Новый ОписаниеТипов("Число"));
	ТаблицаПродукцииТЗРазобрано.Колонки.Добавить("ЭтоЭлемент", 		Новый ОписаниеТипов("Булево"));
	ТаблицаПродукцииТЗРазобрано.Колонки.Добавить("Обработано", 		Новый ОписаниеТипов("Булево"));
	ТаблицаПродукцииТЗРазобрано.Колонки.Добавить("ЭтоАИ", 			Новый ОписаниеТипов("Булево"));
	ТаблицаПродукцииТЗРазобрано.Колонки.Добавить("ДокументСборки");


	ТабЗатратыНаСборку = Новый ТаблицаЗначений;
	ТабЗатратыНаСборку.Колонки.Добавить("Номенклатура", 			Новый ОписаниеТипов("СправочникСсылка.Номенклатура"));
	ТабЗатратыНаСборку.Колонки.Добавить("Характеристика", 			Новый ОписаниеТипов("СправочникСсылка.ХарактеристикиНоменклатуры"));
	ТабЗатратыНаСборку.Колонки.Добавить("Серия", 					Новый ОписаниеТипов("СправочникСсылка.СерииНоменклатуры"));
	ТабЗатратыНаСборку.Колонки.Добавить("Назначение", 				Новый ОписаниеТипов("СправочникСсылка.Назначения"));
	ТабЗатратыНаСборку.Колонки.Добавить("ДокументСборки");
	ТабЗатратыНаСборку.Колонки.Добавить("Склад", 					Новый ОписаниеТипов("СправочникСсылка.Склады"));
	ТабЗатратыНаСборку.Колонки.Добавить("Количество", 				Новый ОписаниеТипов("Число"));


	МассивУдаляемых = Новый Массив;
	ОграничениеЦикла = 0;
	ОсталосьНеразобранныхТекущихКомплектов = ТаблицаПродукцииРазбор.Количество(); 
	Пока ОсталосьНеразобранныхТекущихКомплектов > 0 Цикл
		
		  РазобратьТекущийНабор(ТаблицаПродукцииРазбор, ДатаНачала, ДатаОкончания, МассивУзловАИ);
		
		  МассивУдаляемых.Очистить();
		  Для Каждого СтрокаРазбор Из ТаблицаПродукцииРазбор Цикл
			  Если СтрокаРазбор.Обработано Тогда
				  МассивУдаляемых.Добавить(СтрокаРазбор);
			  КонецЕсли;	
			  Если СтрокаРазбор.ЭтоЭлемент Тогда
				   НоваяСтрокаТП = ТаблицаПродукцииТЗРазобрано.Добавить();
				   ЗаполнитьЗначенияСвойств(НоваяСтрокаТП, СтрокаРазбор);
				   МассивУдаляемых.Добавить(СтрокаРазбор);
			  КонецЕсли;	
		  КонецЦикла;
		  Для Каждого УдаляемыйЭлемент Из МассивУдаляемых Цикл
			  ТаблицаПродукцииРазбор.Удалить(УдаляемыйЭлемент);
		  КонецЦикла;	
		
		
		 ОграничениеЦикла = ОграничениеЦикла + 1;
		 ОсталосьНеразобранныхТекущихКомплектов = ТаблицаПродукцииРазбор.Количество();
		 Если ОграничениеЦикла > 100 Тогда
			  ОсталосьНеразобранныхТекущихКомплектов = 0;
		 КонецЕсли;
		
	КонецЦикла;


	Для Каждого СтрокаРазбор Из ТаблицаПродукцииТЗРазобрано Цикл
		НоваяСтрокаТаблицыРазбор = ТабЗатратыНаСборку.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрокаТаблицыРазбор, СтрокаРазбор);				
	КонецЦикла;
	/////////////////////////////////////////////////////////////////////////////////

	ТабЗатратыНаСборку.Колонки.Добавить("ВидОперации");
	ТабЗатратыНаСборку.ЗаполнитьЗначения("СписаниеЗатрат", "ВидОперации"); 
	
	
	ВнешниеНаборыДанных = Новый Структура;
	ВнешниеНаборыДанных.Вставить("Изготовлено", ТабВыпускПродукции);
	ВнешниеНаборыДанных.Вставить("Потреблено" , ТабЗатратыНаСборку);
	
	// Выводим отчет
	СхемаКД	= ПолучитьМакет("ОсновнаяСхемаКомпоновкиДанных");
	
	ДанныеРасшифровки   = Новый ДанныеРасшифровкиКомпоновкиДанных;
    КомпоновщикМакетаКД	= Новый КомпоновщикМакетаКомпоновкиДанных;
    МакетКД		        = КомпоновщикМакетаКД.Выполнить(СхемаКД, НастройкиКД, ДанныеРасшифровки);

    ПроцессорКД	= Новый ПроцессорКомпоновкиДанных;                                    
    ПроцессорКД.Инициализировать(МакетКД, ВнешниеНаборыДанных, ДанныеРасшифровки);

    ПроцессорВывода = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВТабличныйДокумент;
    ПроцессорВывода.УстановитьДокумент(ДокументРезультат);
    ПроцессорВывода.Вывести(ПроцессорКД);
	
	// Формируем документы
	Если ФормироватьДокументы Тогда
		ДеревоДанных = Новый ДеревоЗначений;
		
		ВнешниеНаборыДанных.Вставить("Изготовлено", Новый ТаблицаЗначений); // для заполнения документов нужна только таблица списаний
		
		МакетКД = КомпоновщикМакетаКД.Выполнить(СхемаКД, НастройкиКД,,, Тип("ГенераторМакетаКомпоновкиДанныхДляКоллекцииЗначений"));

		ПроцессорКД = Новый ПроцессорКомпоновкиДанных;
		ПроцессорКД.Инициализировать(МакетКД, ВнешниеНаборыДанных);

		ПроцессорВывода = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВКоллекциюЗначений;
		ПроцессорВывода.УстановитьОбъект(ДеревоДанных);
		ПроцессорВывода.Вывести(ПроцессорКД);
		
		ИмяФайлаОтчета    = ПолучитьИмяВременногоФайла("mxl");
		ДокументРезультат.Записать(ИмяФайлаОтчета);
		ДанныеФайлаОтчета = Новый ДвоичныеДанные(ИмяФайлаОтчета);
		АдресФайлаОтчета  = ПоместитьВоВременноеХранилище(ДанныеФайлаОтчета);
		
		Отчеты.vs_МатериальныйОтчет_2023.СформироватьДокументыПередачи(ДатаОкончания, Организация, СкладЦеха, ДеревоДанных, АдресФайлаОтчета);
	КонецЕсли;
	
	// Формируем документы
	//Если ФормироватьДокументы Тогда
	//	ДеревоДанных = Новый ДеревоЗначений;
	//	
	//	ВнешниеНаборыДанных.Вставить("Изготовлено", Новый ТаблицаЗначений); // для заполнения документов нужна только таблица списаний
	//	
	//	МакетКД = КомпоновщикМакетаКД.Выполнить(СхемаКД, НастройкиКД,,, Тип("ГенераторМакетаКомпоновкиДанныхДляКоллекцииЗначений"));

	//	ПроцессорКД = Новый ПроцессорКомпоновкиДанных;
	//	ПроцессорКД.Инициализировать(МакетКД, ВнешниеНаборыДанных);

	//	ПроцессорВывода = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВКоллекциюЗначений;
	//	ПроцессорВывода.УстановитьОбъект(ДеревоДанных);
	//	ПроцессорВывода.Вывести(ПроцессорКД);
	//	
	//	ИмяФайлаОтчета    = ПолучитьИмяВременногоФайла("mxl");
	//	ДокументРезультат.Записать(ИмяФайлаОтчета);
	//	ДанныеФайлаОтчета = Новый ДвоичныеДанные(ИмяФайлаОтчета);
	//	АдресФайлаОтчета  = ПоместитьВоВременноеХранилище(ДанныеФайлаОтчета);
	//	
	//	Отчеты.ИТБК_МатериальныйОтчет.СформироватьДокументыПередачи(ДатаОкончания, Организация, СкладЦеха, ДеревоДанных, АдресФайлаОтчета);
	//КонецЕсли;
	
КонецПроцедуры // ПриКомпоновкеРезультата() 

///////////////////////////////   всг+
//Функция ПолучитьВыпускПродукции(Запрос, ДатаНачала, ДатаОкончания, ГотоваяПродукция, СборкаИзКомплектующих) Экспорт
Функция ПолучитьТекстВыпускПродукцииЗатратыНаСборку()
	ТекстЗапроса = "
	|ВЫБРАТЬ
	|	Товары.Регистратор КАК ДокументСборки,
	|	Товары.Номенклатура КАК Номенклатура,
	|	Товары.Характеристика КАК Характеристика,
	|	Товары.Назначение КАК Назначение,
	|	Товары.Склад КАК Склад,
	|	Товары.Помещение КАК Помещение,
	|	Товары.Серия КАК Серия,
	|	Товары.ВНаличииПриход КАК Количество
	|ПОМЕСТИТЬ СборкиПоВыпускуГП
	|ИЗ
	|	РегистрНакопления.ТоварыНаСкладах.Обороты(&ДатаНачала, &ДатаОкончания, Регистратор, ) КАК Товары
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ (ВЫБРАТЬ РАЗЛИЧНЫЕ
	|			ТоварыОрганизацийОбороты.Регистратор КАК ДокументСборки
	|		ИЗ
	|			РегистрНакопления.ТоварыОрганизаций.Обороты(&ДатаНачала, &ДатаОкончания, Регистратор, ) КАК ТоварыОрганизацийОбороты
	|				ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрНакопления.ТоварыОрганизаций КАК ТоварыОрганизаций
	|				ПО ТоварыОрганизацийОбороты.Регистратор = ТоварыОрганизаций.Регистратор
	|					И ТоварыОрганизацийОбороты.АналитикаУчетаНоменклатуры = ТоварыОрганизаций.АналитикаУчетаНоменклатуры
	|					И ТоварыОрганизацийОбороты.Организация = ТоварыОрганизаций.Организация
	|					И ТоварыОрганизацийОбороты.ВидЗапасов = ТоварыОрганизаций.ВидЗапасов
	|					И ТоварыОрганизацийОбороты.НомерГТД = ТоварыОрганизаций.НомерГТД
	|					И (ТоварыОрганизаций.Активность = ИСТИНА)
	|				ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.КлючиАналитикиУчетаНоменклатуры КАК КАУН
	|				ПО ТоварыОрганизаций.АналитикаУчетаНоменклатуры = КАУН.Ссылка
	|				ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Номенклатура КАК СпрНоменклатура
	|				ПО (КАУН.Номенклатура = СпрНоменклатура.Ссылка)
	|		ГДЕ
	|			ТоварыОрганизаций.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|			И СпрНоменклатура.Родитель = &ГотоваяПродукция
	|			И ТоварыОрганизаций.ХозяйственнаяОперация = &СборкаИзКомплектующих) КАК Т
	|		ПО Товары.Регистратор = Т.ДокументСборки
	|;
	|//////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВидыНоменклатуры.Ссылка КАК Ссылка
	|ПОМЕСТИТЬ МассивУзловАИ
	|ИЗ
	|	Справочник.ВидыНоменклатуры КАК ВидыНоменклатуры
	|ГДЕ
	|	НЕ ВидыНоменклатуры.ЭтоГруппа
	|	И ВидыНоменклатуры.Наименование ПОДОБНО &Наименование
	|;
	|//////////////////////////////////////////////////////
	|
	
		//|
		//|////////////////////////////////////////////////////////////////////////////////
		//|ВЫБРАТЬ
		//|	ТоварыОрганизаций.Номенклатура КАК Номенклатура,
		//|	СУММА(ТоварыОрганизаций.Количество) КАК Количество,
		//|	ТоварыОрганизаций.Регистратор КАК Регистратор,
		//|	ТоварыОрганизаций.Регистратор.Склад КАК РегистраторСклад
		//|ПОМЕСТИТЬ СборкиИСписания
		//|ИЗ
		//|	РегистрНакопления.ТоварыОрганизаций КАК ТоварыОрганизаций
		//|ГДЕ
		//|	ТоварыОрганизаций.Регистратор В
		//|			(ВЫБРАТЬ
		//|				СГП.ДокументСборки
		//|			ИЗ
		//|				СборкиПоВыпускуГП КАК СГП)
		//|	И ТоварыОрганизаций.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
		//|
		//|СГРУППИРОВАТЬ ПО
		//|	ТоварыОрганизаций.Номенклатура,
		//|	ТоварыОрганизаций.Регистратор,
		//|	ТоварыОрганизаций.Регистратор.Склад
		
	|ВЫБРАТЬ
	|	Товары.Регистратор КАК ДокументСборки,
	|	Товары.Номенклатура КАК Номенклатура,
	|	Товары.Характеристика КАК Характеристика,
	|	Товары.Назначение КАК Назначение,
	|	Товары.Склад КАК Склад,
	|	Товары.Помещение КАК Помещение,
	|	Товары.Серия КАК Серия,
	|	Товары.ВНаличииРасход КАК Количество
	|ПОМЕСТИТЬ СборкиИСписания
	|ИЗ
	|	РегистрНакопления.ТоварыНаСкладах.Обороты(&ДатаНачала, &ДатаОкончания, Регистратор, ) КАК Товары
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ (ВЫБРАТЬ РАЗЛИЧНЫЕ
	|			ТоварыОрганизацийОбороты.Регистратор КАК ДокументСборки
	|		ИЗ
	|			РегистрНакопления.ТоварыОрганизаций.Обороты(&ДатаНачала, &ДатаОкончания, Регистратор, ) КАК ТоварыОрганизацийОбороты
	|				ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрНакопления.ТоварыОрганизаций КАК ТоварыОрганизаций
	|				ПО ТоварыОрганизацийОбороты.Регистратор = ТоварыОрганизаций.Регистратор
	|					И ТоварыОрганизацийОбороты.АналитикаУчетаНоменклатуры = ТоварыОрганизаций.АналитикаУчетаНоменклатуры
	|					И ТоварыОрганизацийОбороты.Организация = ТоварыОрганизаций.Организация
	|					И ТоварыОрганизацийОбороты.ВидЗапасов = ТоварыОрганизаций.ВидЗапасов
	|					И ТоварыОрганизацийОбороты.НомерГТД = ТоварыОрганизаций.НомерГТД
	|					И (ТоварыОрганизаций.Активность = ИСТИНА)
	//|				ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.КлючиАналитикиУчетаНоменклатуры КАК КАУН
	//|				ПО ТоварыОрганизаций.АналитикаУчетаНоменклатуры = КАУН.Ссылка
	//|				ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Номенклатура КАК СпрНоменклатура
	//|				ПО (КАУН.Номенклатура = СпрНоменклатура.Ссылка)
	|		ГДЕ
	|			ТоварыОрганизаций.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	|			И ТоварыОрганизаций.Регистратор В
	|			(ВЫБРАТЬ
	|				СГП.ДокументСборки
	|			ИЗ
	|				СборкиПоВыпускуГП КАК СГП)
	|			И ТоварыОрганизаций.ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.СборкаТоваров)) КАК Т
	|		ПО Товары.Регистратор = Т.ДокументСборки
		
		
		
		
		
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		
	|ВЫБРАТЬ
	|	Товары.Регистратор КАК ДокументСборки,
	|	Товары.Номенклатура КАК Номенклатура,
	|	Товары.Характеристика КАК Характеристика,
	|	Товары.Назначение КАК Назначение,
	|	Товары.Склад КАК Склад,
	|	Товары.Помещение КАК Помещение,
	|	Товары.Серия КАК Серия,
	|	Товары.ВНаличииРасход КАК Количество
	//|ПОМЕСТИТЬ СборкиИСписания
	|ИЗ
	|	РегистрНакопления.ТоварыНаСкладах.Обороты(&ДатаНачала, &ДатаОкончания, Регистратор, ) КАК Товары
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ (ВЫБРАТЬ РАЗЛИЧНЫЕ
	|			ТоварыОрганизацийОбороты.Регистратор КАК ДокументСборки
	|		ИЗ
	|			РегистрНакопления.ТоварыОрганизаций.Обороты(&ДатаНачала, &ДатаОкончания, Регистратор, ) КАК ТоварыОрганизацийОбороты
	|				ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрНакопления.ТоварыОрганизаций КАК ТоварыОрганизаций
	|				ПО ТоварыОрганизацийОбороты.Регистратор = ТоварыОрганизаций.Регистратор
	|					И ТоварыОрганизацийОбороты.АналитикаУчетаНоменклатуры = ТоварыОрганизаций.АналитикаУчетаНоменклатуры
	|					И ТоварыОрганизацийОбороты.Организация = ТоварыОрганизаций.Организация
	|					И ТоварыОрганизацийОбороты.ВидЗапасов = ТоварыОрганизаций.ВидЗапасов
	|					И ТоварыОрганизацийОбороты.НомерГТД = ТоварыОрганизаций.НомерГТД
	|					И (ТоварыОрганизаций.Активность = ИСТИНА)
	//|				ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.КлючиАналитикиУчетаНоменклатуры КАК КАУН
	//|				ПО ТоварыОрганизаций.АналитикаУчетаНоменклатуры = КАУН.Ссылка
	//|				ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Номенклатура КАК СпрНоменклатура
	//|				ПО (КАУН.Номенклатура = СпрНоменклатура.Ссылка)
	|		ГДЕ
	|			ТоварыОрганизаций.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	|	И ТИПЗНАЧЕНИЯ(ТоварыОрганизаций.Регистратор) = ТИП(Документ.ВнутреннееПотребление)
	|	И (ТоварыОрганизаций.СтатьяРасходов В(&ДопизготовлениеПроизводство))
	|			//И ТоварыОрганизаций.ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.СборкаТоваров)) КАК Т
	|) КАК Т
	|		ПО Товары.Регистратор = Т.ДокументСборки
		
		
		//|ВЫБРАТЬ
		//|	ТоварыОрганизаций.Номенклатура,
		//|	СУММА(ТоварыОрганизаций.Количество),		
		//|	ТоварыОрганизаций.Регистратор,
		//|	ТоварыОрганизаций.Регистратор.Склад
		//|ИЗ
		//|	РегистрНакопления.ТоварыОрганизаций КАК ТоварыОрганизаций
		//|ГДЕ
		//|	ТоварыОрганизаций.Активность
		//|	И ТоварыОрганизаций.Период МЕЖДУ &ДатаНачала И &ДатаОкончания
		//|	И ТоварыОрганизаций.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
		//|	И ТИПЗНАЧЕНИЯ(ТоварыОрганизаций.Регистратор) = ТИП(Документ.ВнутреннееПотребление)
		//|	И (ТоварыОрганизаций.СтатьяРасходов = &Допизготовление
		//|			ИЛИ ТоварыОрганизаций.СтатьяРасходов = &Производство)
		//|
		//|СГРУППИРОВАТЬ ПО
		//|	ТоварыОрганизаций.Регистратор,
		//|	ТоварыОрганизаций.Номенклатура,
		//|	ТоварыОрганизаций.Регистратор.Склад
		|;
		|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	Товары.ДокументСборки КАК ДокументСборки,
	|	Товары.Номенклатура КАК Номенклатура,
	|	Товары.Характеристика КАК Характеристика,
	|	Товары.Назначение КАК Назначение,
	|	Товары.Склад КАК Склад,
	|	Товары.Помещение КАК Помещение,
	|	Товары.Серия КАК Серия,
	|	СУММА(Товары.Количество) КАК Количество
	//
	//	|	СборкиИСписания.Номенклатура КАК Номенклатура,
	//	|	СУММА(СборкиИСписания.Количество) КАК Количество,
	//	|	СборкиИСписания.Регистратор КАК ДокументСборки,
	//	|	СборкиИСписания.РегистраторСклад КАК Склад
	|ИЗ
	|	СборкиИСписания КАК Товары
	|
	|СГРУППИРОВАТЬ ПО
	|	Товары.ДокументСборки,
	|	Товары.Номенклатура,
	|	Товары.Характеристика,
	|	Товары.Назначение,
	|	Товары.Склад,
	|	Товары.Помещение,
	|	Товары.Серия
	|";  

	Возврат ТекстЗапроса;
	
КонецФункции // ПолучитьТекстВыпускПродукцииЗатратыНаСборку()

Процедура РазобратьТекущийНабор(ТаблицаПродукцииРазбор, ПериодОтчетаНачало, ПериодОтчетаКонец, МассивУзловАИ)

	Для Каждого СтрокаТ Из ТаблицаПродукцииРазбор Цикл
		
		ЗапросЭтоЭлемент = Новый Запрос("
		//|ВЫБРАТЬ ПЕРВЫЕ 1
		//|	ТоварыОрганизацийОбороты.Период КАК Период,
		//|	ТоварыОрганизацийОбороты.Регистратор КАК ДокументСборки,
		//|	ТоварыОрганизацийОбороты.КоличествоПриход КАК КоличествоПриход
		//|ИЗ
		//|	РегистрНакопления.ТоварыОрганизаций.Обороты(&НачалоПериода, &КонецПериода, Регистратор, АналитикаУчетаНоменклатуры.Номенклатура = &Номенклатура) КАК ТоварыОрганизацийОбороты
		//|ГДЕ
		//|	ТИПЗНАЧЕНИЯ(ТоварыОрганизацийОбороты.Регистратор) = ТИП(Документ.СборкаТоваров)
		//|	И ТоварыОрганизацийОбороты.КоличествоПриход > 0
		//|
		//|УПОРЯДОЧИТЬ ПО
		//|	Период УБЫВ"); 
		////////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ ПЕРВЫЕ 1
		|	Товары.Период КАК Период,
		|	Товары.Регистратор КАК ДокументСборки,
		|	Товары.Номенклатура КАК Номенклатура,
		|	Товары.Характеристика КАК Характеристика,
		|	Товары.Назначение КАК Назначение,
		|	Товары.Склад КАК Склад,
		|	Товары.Помещение КАК Помещение,
		|	Товары.Серия КАК Серия,
		|	Товары.ВНаличииПриход КАК Количество
		//|ПОМЕСТИТЬ СборкиПоВыпускуГП
		|ИЗ
		|	РегистрНакопления.ТоварыНаСкладах.Обороты(&ДатаНачала, &ДатаОкончания, Регистратор, 
		|			Номенклатура = &Номенклатура и Характеристика = &Характеристика И Серия = &Серия) КАК Товары
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ (ВЫБРАТЬ РАЗЛИЧНЫЕ
		|			ТоварыОрганизацийОбороты.Регистратор КАК ДокументСборки
		|		ИЗ
		|			РегистрНакопления.ТоварыОрганизаций.Обороты(&ДатаНачала, &ДатаОкончания, Регистратор, ) КАК ТоварыОрганизацийОбороты
		|				ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрНакопления.ТоварыОрганизаций КАК ТоварыОрганизаций
		|				ПО ТоварыОрганизацийОбороты.Регистратор = ТоварыОрганизаций.Регистратор
		|					И ТоварыОрганизацийОбороты.АналитикаУчетаНоменклатуры = ТоварыОрганизаций.АналитикаУчетаНоменклатуры
		|					И ТоварыОрганизацийОбороты.Организация = ТоварыОрганизаций.Организация
		|					И ТоварыОрганизацийОбороты.ВидЗапасов = ТоварыОрганизаций.ВидЗапасов
		|					И ТоварыОрганизацийОбороты.НомерГТД = ТоварыОрганизаций.НомерГТД
		|					И (ТоварыОрганизаций.Активность = ИСТИНА)
		|				ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.КлючиАналитикиУчетаНоменклатуры КАК КАУН
		|				ПО ТоварыОрганизаций.АналитикаУчетаНоменклатуры = КАУН.Ссылка
		|				ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Номенклатура КАК СпрНоменклатура
		|				ПО (КАУН.Номенклатура = СпрНоменклатура.Ссылка)
		|		ГДЕ
		|			ТоварыОрганизаций.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
		|			И ТИПЗНАЧЕНИЯ(ТоварыОрганизацийОбороты.Регистратор) = ТИП(Документ.СборкаТоваров)
		|			И ТоварыОрганизацийОбороты.КоличествоПриход > 0
		//|			И ТоварыОрганизаций.ХозяйственнаяОперация = &СборкаИзКомплектующих
		|			) КАК Т
		|		ПО Товары.Регистратор = Т.ДокументСборки
		|
		|УПОРЯДОЧИТЬ ПО
		|	Период УБЫВ"); 
		ЗапросЭтоЭлемент.УстановитьПараметр("ДатаНачала"     	, Новый Граница(Дата(2000,01,01), ВидГраницы.Включая));
		ЗапросЭтоЭлемент.УстановитьПараметр("ДатаОкончания"     , Новый Граница(ПериодОтчетаКонец, ВидГраницы.Включая));
		ЗапросЭтоЭлемент.УстановитьПараметр("Номенклатура"     	, СтрокаТ.Номенклатура); 
		ЗапросЭтоЭлемент.УстановитьПараметр("Характеристика"   	, СтрокаТ.Характеристика); 
		ЗапросЭтоЭлемент.УстановитьПараметр("Серия"     		, СтрокаТ.Серия); 
		
		ТаблицаЗапросЭтоЭлемент = ЗапросЭтоЭлемент.Выполнить().Выгрузить();
		
		Если ТаблицаЗапросЭтоЭлемент.Количество() = 0 Тогда
			СтрокаТ.ЭтоЭлемент = ИСТИНА;
		Иначе
			ЗапросРазборКомплекта = Новый Запрос("
			//"ВЫБРАТЬ
			//|	ТоварыОрганизаций.Номенклатура КАК Номенклатура,
			//|	СУММА(ТоварыОрганизаций.Количество / ТоварыОрганизаций.Регистратор.Количество*&КоличествоКомплектов) КАК Количество,
			//|	ТоварыОрганизаций.Регистратор КАК ДокументСборки,
			//|	ТоварыОрганизаций.Регистратор.Склад КАК Склад
			//|ИЗ
			//|	РегистрНакопления.ТоварыОрганизаций КАК ТоварыОрганизаций
			//|ГДЕ
			//|	ТоварыОрганизаций.Активность
			//|	И ТоварыОрганизаций.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
			//|	И ТоварыОрганизаций.Регистратор = &Регистратор
			//|
			//|СГРУППИРОВАТЬ ПО
			//|	ТоварыОрганизаций.Регистратор,
			//|	ТоварыОрганизаций.Регистратор.Склад,
			//|	ТоварыОрганизаций.Номенклатура");
		
			|ВЫБРАТЬ
		    |	Товары.Регистратор КАК ДокументСборки,
		    |	Товары.Номенклатура КАК Номенклатура,
		    |	Товары.Характеристика КАК Характеристика,
		    |	Товары.Назначение КАК Назначение,
		    |	Товары.Склад КАК Склад,
		    |	Товары.Помещение КАК Помещение,
		    |	Товары.Серия КАК Серия,
		    |	ЕСТЬNULL(СУММА(&КоличествоКомплектов * Товары.ВНаличииРасход / &КоличествоКомплектовИсходное),0) КАК Количество
		    |ИЗ
		    |	РегистрНакопления.ТоварыНаСкладах.Обороты(&ДатаНачала, &ДатаОкончания, Регистратор, ) КАК Товары
		    |ГДЕ
		    |	Товары.Регистратор = &Регистратор
		    |
		    |СГРУППИРОВАТЬ ПО
		    |	Товары.Назначение,
		    |	Товары.Характеристика,
		    |	Товары.Серия,
		    |	Товары.Помещение,
		    |	Товары.Склад,
		    |	Товары.Регистратор,
		    |	Товары.Номенклатура
		    |
		    |ИМЕЮЩИЕ
		    |	ЕСТЬNULL(СУММА(&КоличествоКомплектов * Товары.ВНаличииРасход / &КоличествоКомплектовИсходное),0) > 0");
			
			ЗапросРазборКомплекта.УстановитьПараметр("Регистратор"     				, ТаблицаЗапросЭтоЭлемент[0].ДокументСборки);
			ЗапросРазборКомплекта.УстановитьПараметр("ДатаНачала"					, Новый Граница(НачалоДня(ТаблицаЗапросЭтоЭлемент[0].ДокументСборки.Дата)));
			ЗапросРазборКомплекта.УстановитьПараметр("ДатаОкончания"				, Новый Граница(КонецДня(ТаблицаЗапросЭтоЭлемент[0].ДокументСборки.Дата)));
			ЗапросРазборКомплекта.УстановитьПараметр("КоличествоКомплектовИсходное"	, ТаблицаЗапросЭтоЭлемент[0].ДокументСборки.Количество);
			ЗапросРазборКомплекта.УстановитьПараметр("КоличествоКомплектовИсходное"	, 
				?(ЗапросРазборКомплекта.Параметры.КоличествоКомплектовИсходное = 0, 1, ЗапросРазборКомплекта.Параметры.КоличествоКомплектовИсходное));
			ЗапросРазборКомплекта.УстановитьПараметр("КоличествоКомплектов"     	, СтрокаТ.Количество);

			ТаблицаРазборКомплекта = ЗапросРазборКомплекта.Выполнить().Выгрузить();
			
			Для Каждого СтрокаЗапроса2Р Из ТаблицаРазборКомплекта Цикл
				НоваяСтрокаТаблицыРазбор = ТаблицаПродукцииРазбор.Добавить();
				ЗаполнитьЗначенияСвойств(НоваяСтрокаТаблицыРазбор, СтрокаЗапроса2Р);
				ИндексМ = МассивУзловАИ.Найти(СтрокаТ.Номенклатура.ВидНоменклатуры);
				Если ИндексМ <> Неопределено Тогда
				    НоваяСтрокаТаблицыРазбор.ЭтоАИ = ИСТИНА;
					НоваяСтрокаТаблицыРазбор.СкладАИ = СтрокаТ.Склад;
				КонецЕсли;
				Если СтрокаТ.ЭтоАИ Тогда
				    НоваяСтрокаТаблицыРазбор.ЭтоАИ = ИСТИНА;
					НоваяСтрокаТаблицыРазбор.СкладАИ = СтрокаТ.СкладАИ;
				КонецЕсли;
			
			КонецЦикла;
			СтрокаТ.Обработано = ИСТИНА;
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры




//Функция ПолучитьЗатратыНаСборку(Запрос, ДатаНачала, ДатаОкончания, ГруппаГП, СтатьяРасходов) Экспорт        //всг++
//	
//	    //ГруппаГП = Справочники.Номенклатура.НайтиПоНаименованию("ГП");
//	    МассивУзловАИ = Новый Массив;
//		
//		ЗапросАИ = Новый Запрос;
//		ЗапросАИ.Текст = 
//			"ВЫБРАТЬ
//			|	ВидыНоменклатуры.Ссылка КАК Ссылка
//			|ИЗ
//			|	Справочник.ВидыНоменклатуры КАК ВидыНоменклатуры
//			|ГДЕ
//			|	НЕ ВидыНоменклатуры.ЭтоГруппа
//			|	И ВидыНоменклатуры.Наименование ПОДОБНО &Наименование";
//		
//		ЗапросАИ.УстановитьПараметр("Наименование", "%(АИ)%");
//		
//		РезультатЗапросаАИ = ЗапросАИ.Выполнить();
//		
//		ВыборкаАИ = РезультатЗапросаАИ.Выбрать();
//		
//		Пока ВыборкаАИ.Следующий() Цикл
//			МассивУзловАИ.Добавить(ВыборкаАИ.Ссылка);			
//		КонецЦикла;
//				

//		///запрос по первому уровню сборки готового продукта (сбока и внутренне потребление)
//		Запрос = Новый Запрос(
//		"ВЫБРАТЬ
//		|	ТоварыОрганизаций.Регистратор КАК ДокументСборки
//		|ПОМЕСТИТЬ СборкиПоВыпускуГП
//		|ИЗ
//		|	РегистрНакопления.ТоварыОрганизаций КАК ТоварыОрганизаций
//		|ГДЕ
//		|	ТоварыОрганизаций.Активность
//		|	И ТоварыОрганизаций.Период МЕЖДУ &ДатаНачала И &ДатаОкончания
//		|	И ТоварыОрганизаций.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
//		|	И ТоварыОрганизаций.АналитикаУчетаНоменклатуры.Номенклатура.Родитель = &ГруппаГП
//		|	И ТоварыОрганизаций.ХозяйственнаяОперация = &СборкаИзКомплектующих
//		|
//		|СГРУППИРОВАТЬ ПО
//		|	ТоварыОрганизаций.Регистратор
//		|;
//		|
//		|////////////////////////////////////////////////////////////////////////////////
//		|ВЫБРАТЬ
//		|	ТоварыОрганизаций.Номенклатура КАК Номенклатура,
//		|	СУММА(ТоварыОрганизаций.Количество) КАК Количество,
//		|	ТоварыОрганизаций.Регистратор КАК Регистратор,
//		|	ТоварыОрганизаций.Регистратор.Склад КАК РегистраторСклад
//		|ПОМЕСТИТЬ СборкиИСписания
//		|ИЗ
//		|	РегистрНакопления.ТоварыОрганизаций КАК ТоварыОрганизаций
//		|ГДЕ
//		|	ТоварыОрганизаций.Регистратор В
//		|			(ВЫБРАТЬ
//		|				СГП.ДокументСборки
//		|			ИЗ
//		|				СборкиПоВыпускуГП КАК СГП)
//		|	И ТоварыОрганизаций.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
//		|
//		|СГРУППИРОВАТЬ ПО
//		|	ТоварыОрганизаций.Номенклатура,
//		|	ТоварыОрганизаций.Регистратор,
//		|	ТоварыОрганизаций.Регистратор.Склад
//		|
//		|ОБЪЕДИНИТЬ ВСЕ
//		|
//		|ВЫБРАТЬ
//		|	ТоварыОрганизаций.Номенклатура,
//		|	СУММА(ТоварыОрганизаций.Количество),		
//		|	ТоварыОрганизаций.Регистратор,
//		|	ТоварыОрганизаций.Регистратор.Склад
//		|ИЗ
//		|	РегистрНакопления.ТоварыОрганизаций КАК ТоварыОрганизаций
//		|ГДЕ
//		|	ТоварыОрганизаций.Активность
//		|	И ТоварыОрганизаций.Период МЕЖДУ &ДатаНачала И &ДатаОкончания
//		|	И ТоварыОрганизаций.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
//		|	И ТИПЗНАЧЕНИЯ(ТоварыОрганизаций.Регистратор) = ТИП(Документ.ВнутреннееПотребление)
//		|	И (ТоварыОрганизаций.СтатьяРасходов = &Допизготовление
//		|			ИЛИ ТоварыОрганизаций.СтатьяРасходов = &Производство)
//		|
//		|СГРУППИРОВАТЬ ПО
//		|	ТоварыОрганизаций.Регистратор,
//		|	ТоварыОрганизаций.Номенклатура,
//		|	ТоварыОрганизаций.Регистратор.Склад
//		|;
//		|
//		|////////////////////////////////////////////////////////////////////////////////
//		|ВЫБРАТЬ
//		|	СборкиИСписания.Номенклатура КАК Номенклатура,
//		|	СУММА(СборкиИСписания.Количество) КАК Количество,
//		|	СборкиИСписания.Регистратор КАК ДокументСборки,
//		|	СборкиИСписания.РегистраторСклад КАК Склад
//		|ИЗ
//		|	СборкиИСписания КАК СборкиИСписания
//		|
//		|СГРУППИРОВАТЬ ПО
//		|	СборкиИСписания.Номенклатура,
//		|	СборкиИСписания.Регистратор,
//		|	СборкиИСписания.РегистраторСклад");
//		
//		
//		Запрос.УстановитьПараметр("ДатаНачала"           , ДатаНачала);
//		Запрос.УстановитьПараметр("ДатаОкончания"        , ДатаОкончания);
//		Запрос.УстановитьПараметр("ГруппаГП"     , ГруппаГП);
//		Запрос.УстановитьПараметр("СборкаИзКомплектующих", Перечисления.ХозяйственныеОперации.СборкаТоваров);
//		Запрос.УстановитьПараметр("Допизготовление"        , ПланыВидовХарактеристик.СтатьиРасходов.НайтиПоНаименованию("!!! Доизготовление")); 
//		Запрос.УстановитьПараметр("Производство"        , ПланыВидовХарактеристик.СтатьиРасходов.НайтиПоНаименованию("!! Списание в производство (в мат.отчет)")); 
//		
//		
//		ТаблицаПродукцииРазбор = Запрос.Выполнить().Выгрузить();
//		ТаблицаПродукцииРазбор.Колонки.Добавить("ЭтоЭлемент", Новый ОписаниеТипов("Булево"));
//		ТаблицаПродукцииРазбор.Колонки.Добавить("Обработано", Новый ОписаниеТипов("Булево"));
//		ТаблицаПродукцииРазбор.Колонки.Добавить("ЭтоАИ", Новый ОписаниеТипов("Булево"));
//		ТаблицаПродукцииРазбор.Колонки.Добавить("СкладАИ", Новый ОписаниеТипов("СправочникСсылка.Склады"));

//		ТаблицаПродукцииТЗРазобрано = Новый ТаблицаЗначений;
//		ТаблицаПродукцииТЗРазобрано.Колонки.Добавить("Номенклатура", Новый ОписаниеТипов("СправочникСсылка.Номенклатура"));
//		ТаблицаПродукцииТЗРазобрано.Колонки.Добавить("Склад", Новый ОписаниеТипов("СправочникСсылка.Склады"));
//		ТаблицаПродукцииТЗРазобрано.Колонки.Добавить("Количество", Новый ОписаниеТипов("Число"));
//		ТаблицаПродукцииТЗРазобрано.Колонки.Добавить("ЭтоЭлемент", Новый ОписаниеТипов("Булево"));
//		ТаблицаПродукцииТЗРазобрано.Колонки.Добавить("Обработано", Новый ОписаниеТипов("Булево"));
//		ТаблицаПродукцииТЗРазобрано.Колонки.Добавить("ЭтоАИ", Новый ОписаниеТипов("Булево"));
//		ТаблицаПродукцииТЗРазобрано.Колонки.Добавить("ДокументСборки");

//		
//		ТаблицаПродукцииИтог = Новый ТаблицаЗначений;
//		ТаблицаПродукцииИтог.Колонки.Добавить("Номенклатура", Новый ОписаниеТипов("СправочникСсылка.Номенклатура"));
//		ТаблицаПродукцииИтог.Колонки.Добавить("ДокументСборки");
//		ТаблицаПродукцииИтог.Колонки.Добавить("Склад", Новый ОписаниеТипов("СправочникСсылка.Склады"));
//		ТаблицаПродукцииИтог.Колонки.Добавить("Количество", Новый ОписаниеТипов("Число"));
//	
//	
//		МассивУдаляемых = Новый Массив;
//		ОграничениеЦикла = 0;
//		ОсталосьНеразобранныхТекущихКомплектов = ТаблицаПродукцииРазбор.Количество(); 
//		Пока  ОсталосьНеразобранныхТекущихКомплектов > 0 Цикл
//			
//			  РазобратьТекущийНабор(ТаблицаПродукцииРазбор, ДатаНачала, ДатаОкончания, МассивУзловАИ);
//			
//			  МассивУдаляемых.Очистить();
//			  Для Каждого СтрокаРазбор Из ТаблицаПродукцииРазбор Цикл
//				  Если СтрокаРазбор.Обработано Тогда
//					  МассивУдаляемых.Добавить(СтрокаРазбор);
//				  КонецЕсли;	
//				  Если СтрокаРазбор.ЭтоЭлемент Тогда
//					   НоваяСтрокаТП = ТаблицаПродукцииТЗРазобрано.Добавить();
//					   ЗаполнитьЗначенияСвойств(НоваяСтрокаТП, СтрокаРазбор);
//					   МассивУдаляемых.Добавить(СтрокаРазбор);
//				  КонецЕсли;	
//			  КонецЦикла;
//			  Для Каждого УдаляемыйЭлемент Из МассивУдаляемых Цикл
//				  ТаблицаПродукцииРазбор.Удалить(УдаляемыйЭлемент);
//			  КонецЦикла;	
//			
//			
//			 ОграничениеЦикла = ОграничениеЦикла + 1;
//			 ОсталосьНеразобранныхТекущихКомплектов = ТаблицаПродукцииРазбор.Количество();
//			 Если ОграничениеЦикла > 100 Тогда
//				  ОсталосьНеразобранныхТекущихКомплектов = 0;
//			 КонецЕсли;
//			
//		КонецЦикла;
//		

//		Для Каждого СтрокаРазбор Из ТаблицаПродукцииТЗРазобрано Цикл
//			НоваяСтрокаТаблицыРазбор = ТаблицаПродукцииИтог.Добавить();
//			ЗаполнитьЗначенияСвойств(НоваяСтрокаТаблицыРазбор, СтрокаРазбор);				
//	    КонецЦикла;
//	
//		Возврат  ТаблицаПродукцииИтог;

//КонецФункции


	//Запрос = Новый Запрос(
	//"ВЫБРАТЬ
	//|	ТоварыОрганизаций.Номенклатура КАК Номенклатура,
	//|	ТоварыОрганизаций.Регистратор КАК ДокументСборки,
	//|	СУММА(ТоварыОрганизаций.Количество) КАК Количество
	//|ИЗ
	//|	РегистрНакопления.ТоварыОрганизаций КАК ТоварыОрганизаций
	//|ГДЕ
	//|	ТоварыОрганизаций.Активность
	//|	И ТоварыОрганизаций.Период МЕЖДУ &ДатаНачала И &ДатаОкончания
	//|	И ТоварыОрганизаций.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	//|	И ТоварыОрганизаций.АналитикаУчетаНоменклатуры.Номенклатура.Родитель = &ГотоваяПродукция
	//|	И ТоварыОрганизаций.ХозяйственнаяОперация = &СборкаИзКомплектующих
	//|
	//|СГРУППИРОВАТЬ ПО
	//|	ТоварыОрганизаций.Номенклатура,
	//|	ТоварыОрганизаций.Регистратор"); 
	//
	//Запрос.УстановитьПараметр("ДатаНачала"           , ДатаНачала);
	//Запрос.УстановитьПараметр("ДатаОкончания"        , ДатаОкончания);
	//Запрос.УстановитьПараметр("ГотоваяПродукция"     , ГотоваяПродукция);
	//Запрос.УстановитьПараметр("СборкаИзКомплектующих", СборкаИзКомплектующих);
	//
	//З = Запрос.Выполнить().Выгрузить();
	


	
	
	
//Функция ТекстЗапросаРазблюдовкаПоСериям()
//	
//	Возврат "ВЫБРАТЬ
//	        |	ТЗСерииНоменклатуры.Номенклатура КАК Номенклатура,
//	        |	ТЗСерииНоменклатуры.Серия КАК Серия
//	        |ПОМЕСТИТЬ ВТСерииНоменклатуры
//	        |ИЗ
//	        |	&ТЗСерииНоменклатуры КАК ТЗСерииНоменклатуры
//	        |
//	        |ИНДЕКСИРОВАТЬ ПО
//	        |	Номенклатура,
//	        |	Серия
//	        |;
//	        |
//	        |////////////////////////////////////////////////////////////////////////////////
//	        |ВЫБРАТЬ
//	        |	ТоварыНаСкладах.Регистратор КАК Регистратор,
//	        |	ТоварыНаСкладах.Номенклатура КАК Номенклатура,
//	        |	ТоварыНаСкладах.Серия КАК Серия,
//	        |	СУММА(ТоварыНаСкладах.ВНаличии) КАК Количество
//	        |ПОМЕСТИТЬ ВТТоварыНаСкладах
//	        |ИЗ
//	        |	РегистрНакопления.ТоварыНаСкладах КАК ТоварыНаСкладах
//	        |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТСерииНоменклатуры КАК ВТСерииНоменклатуры
//	        |		ПО (ТоварыНаСкладах.Активность)
//	        |			И (ТоварыНаСкладах.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход))
//	        |			И ТоварыНаСкладах.Номенклатура = ВТСерииНоменклатуры.Номенклатура
//	        |			И ТоварыНаСкладах.Серия = ВТСерииНоменклатуры.Серия
//	        |			И (ТоварыНаСкладах.Регистратор ССЫЛКА Документ.СборкаТоваров)
//	        |
//	        |СГРУППИРОВАТЬ ПО
//	        |	ТоварыНаСкладах.Номенклатура,
//	        |	ТоварыНаСкладах.Серия,
//	        |	ТоварыНаСкладах.Регистратор
//	        |
//	        |ИНДЕКСИРОВАТЬ ПО
//	        |	Регистратор
//	        |;
//	        |
//	        |////////////////////////////////////////////////////////////////////////////////
//	        |ВЫБРАТЬ
//	        |	ВТТоварыНаСкладах.Номенклатура КАК Номенклатура,
//	        |	ВТТоварыНаСкладах.Серия КАК Серия,
//	        |	СУММА(ВТТоварыНаСкладах.Количество) КАК Количество,
//	        |	ТоварыНаСкладах.Номенклатура КАК Комплектующее,
//	        |	ТоварыНаСкладах.Серия КАК СерияКомплектующего,
//	        |	ВЫБОР
//	        |		КОГДА ТоварыНаСкладах.Серия = ЗНАЧЕНИЕ(Справочник.СерииНоменклатуры.ПустаяСсылка)
//	        |			ТОГДА ЛОЖЬ
//	        |		ИНАЧЕ ИСТИНА
//	        |	КОНЕЦ КАК СерияУказана,
//	        |	ЕСТЬNULL(ВариантыКомплектацииНоменклатуры.Ссылка, ЗНАЧЕНИЕ(Справочник.ВариантыКомплектацииНоменклатуры.ПустаяСсылка)) КАК ВариантКомплектации,
//	        |	ВЫБОР
//	        |		КОГДА ЕСТЬNULL(ВариантыКомплектацииНоменклатуры.Ссылка, ЗНАЧЕНИЕ(Справочник.ВариантыКомплектацииНоменклатуры.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.ВариантыКомплектацииНоменклатуры.ПустаяСсылка)
//	        |			ТОГДА ЛОЖЬ
//	        |		ИНАЧЕ ИСТИНА
//	        |	КОНЕЦ КАК ВариантКомплектацииУказан,
//	        |	СУММА(ТоварыНаСкладах.ВНаличии) КАК КоличествоКомплектующих
//	        |ИЗ
//	        |	ВТТоварыНаСкладах КАК ВТТоварыНаСкладах
//	        |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрНакопления.ТоварыНаСкладах КАК ТоварыНаСкладах
//	        |			ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ВариантыКомплектацииНоменклатуры КАК ВариантыКомплектацииНоменклатуры
//	        |			ПО ТоварыНаСкладах.Номенклатура = ВариантыКомплектацииНоменклатуры.Владелец
//	        |				И (ВариантыКомплектацииНоменклатуры.Основной)
//	        |				И (НЕ ВариантыКомплектацииНоменклатуры.ПометкаУдаления)
//	        |		ПО (ТоварыНаСкладах.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход))
//	        |			И ВТТоварыНаСкладах.Регистратор = ТоварыНаСкладах.Регистратор
//	        |
//	        |СГРУППИРОВАТЬ ПО
//	        |	ВТТоварыНаСкладах.Номенклатура,
//	        |	ВТТоварыНаСкладах.Серия,
//	        |	ТоварыНаСкладах.Номенклатура,
//	        |	ТоварыНаСкладах.Серия,
//	        |	ВЫБОР
//	        |		КОГДА ТоварыНаСкладах.Серия = ЗНАЧЕНИЕ(Справочник.СерииНоменклатуры.ПустаяСсылка)
//	        |			ТОГДА ЛОЖЬ
//	        |		ИНАЧЕ ИСТИНА
//	        |	КОНЕЦ,
//	        |	ЕСТЬNULL(ВариантыКомплектацииНоменклатуры.Ссылка, ЗНАЧЕНИЕ(Справочник.ВариантыКомплектацииНоменклатуры.ПустаяСсылка)),
//	        |	ВЫБОР
//	        |		КОГДА ЕСТЬNULL(ВариантыКомплектацииНоменклатуры.Ссылка, ЗНАЧЕНИЕ(Справочник.ВариантыКомплектацииНоменклатуры.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.ВариантыКомплектацииНоменклатуры.ПустаяСсылка)
//	        |			ТОГДА ЛОЖЬ
//	        |		ИНАЧЕ ИСТИНА
//	        |	КОНЕЦ";
// 
//	
//КонецФункции // ТекстЗапросаРазблюдовкаПоСериям()

//Функция ТекстЗапросаРазблюдовкаПоСпецификациям()
//	
//	Возврат "ВЫБРАТЬ
//	        |	ВариантыКомплектацииНоменклатурыТовары.Ссылка.Владелец КАК Номенклатура,
//	        |	ВариантыКомплектацииНоменклатурыТовары.Ссылка.Количество КАК Количество,
//	        |	ВариантыКомплектацииНоменклатурыТовары.Номенклатура КАК Комплектующее,
//	        |	ВариантыКомплектацииНоменклатурыТовары.Количество КАК КоличествоКомплектующих,
//	        |	ЕСТЬNULL(ВариантыКомплектацииНоменклатуры.Ссылка, ЗНАЧЕНИЕ(Справочник.ВариантыКомплектацииНоменклатуры.ПустаяСсылка)) КАК ВариантКомплектации,
//	        |	ВЫБОР
//	        |		КОГДА ЕСТЬNULL(ВариантыКомплектацииНоменклатуры.Ссылка, ЗНАЧЕНИЕ(Справочник.ВариантыКомплектацииНоменклатуры.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.ВариантыКомплектацииНоменклатуры.ПустаяСсылка)
//	        |			ТОГДА ЛОЖЬ
//	        |		ИНАЧЕ ИСТИНА
//	        |	КОНЕЦ КАК ВариантКомплектацииУказан
//	        |ИЗ
//	        |	Справочник.ВариантыКомплектацииНоменклатуры.Товары КАК ВариантыКомплектацииНоменклатурыТовары
//	        |		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ВариантыКомплектацииНоменклатуры КАК ВариантыКомплектацииНоменклатуры
//	        |		ПО ВариантыКомплектацииНоменклатурыТовары.Номенклатура = ВариантыКомплектацииНоменклатуры.Владелец
//	        |			И (ВариантыКомплектацииНоменклатуры.Основной)
//	        |			И (НЕ ВариантыКомплектацииНоменклатуры.ПометкаУдаления)
//	        |ГДЕ
//	        |	ВариантыКомплектацииНоменклатурыТовары.Ссылка В(&ВариантыКомплектации)";	
//	
//КонецФункции // ТекстЗапросаРазблюдовкаПоСпецификациям()

//Функция ПолучитьЗатратыНаСборкуСтарый(ДатаНачала, ДатаОкончания, ГотоваяПродукция, СтатьяРасходов) Экспорт
//	
//	Запрос = Новый Запрос(
//	"ВЫБРАТЬ
//	|	ТоварыОрганизаций.Регистратор КАК Регистратор,
//	|	ТоварыОрганизаций.АналитикаУчетаНоменклатуры.Номенклатура КАК Номенклатура
//	|ПОМЕСТИТЬ ВТТоварыОрганизаций
//	|ИЗ
//	|	РегистрНакопления.ТоварыОрганизаций КАК ТоварыОрганизаций
//	|ГДЕ
//	|	ТоварыОрганизаций.Активность
//	|	И ТоварыОрганизаций.Период МЕЖДУ &ДатаНачала И &ДатаОкончания
//	|	И ТоварыОрганизаций.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
//	|	И ТоварыОрганизаций.ХозяйственнаяОперация <> ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ПеремещениеТоваров)
//	|	И ТоварыОрганизаций.АналитикаРасходов.Родитель = &ГотоваяПродукция
//	|
//	|ОБЪЕДИНИТЬ
//	|
//	|ВЫБРАТЬ
//	|	ТоварыОрганизаций.Регистратор,
//	|	ТоварыОрганизаций.АналитикаУчетаНоменклатуры.Номенклатура
//	|ИЗ
//	|	РегистрНакопления.ТоварыОрганизаций КАК ТоварыОрганизаций
//	|ГДЕ
//	|	ТоварыОрганизаций.Активность
//	|	И ТоварыОрганизаций.Период МЕЖДУ &ДатаНачала И &ДатаОкончания
//	|	И ТоварыОрганизаций.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
//	|	И ТоварыОрганизаций.ХозяйственнаяОперация <> ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ПеремещениеТоваров)
//	|	И ТоварыОрганизаций.КорАналитикаУчетаНоменклатуры.Номенклатура.Родитель = &ГотоваяПродукция
//	|
//	|ОБЪЕДИНИТЬ
//	|
//	|ВЫБРАТЬ
//	|	ТоварыОрганизаций.Регистратор,
//	|	ТоварыОрганизаций.АналитикаУчетаНоменклатуры.Номенклатура
//	|ИЗ
//	|	РегистрНакопления.ТоварыОрганизаций КАК ТоварыОрганизаций
//	|ГДЕ
//	|	ТоварыОрганизаций.Активность
//	|	И ТоварыОрганизаций.Период МЕЖДУ &ДатаНачала И &ДатаОкончания
//	|	И ТоварыОрганизаций.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
//	|	И ТоварыОрганизаций.ХозяйственнаяОперация <> ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ПеремещениеТоваров)
//	|	И ТоварыОрганизаций.СтатьяРасходов = &СтатьяРасходов
//	|
//	|ИНДЕКСИРОВАТЬ ПО
//	|	Номенклатура
//	|;
//	|
//	|////////////////////////////////////////////////////////////////////////////////
//	|ВЫБРАТЬ
//	|	ТоварыНаСкладахОбороты.Номенклатура КАК Номенклатура,
//	|	ТоварыНаСкладахОбороты.Склад КАК Склад,
//	|	ТоварыНаСкладахОбороты.Серия КАК Серия,
//	|	ВЫБОР
//	|		КОГДА ТоварыНаСкладахОбороты.Серия = ЗНАЧЕНИЕ(Справочник.СерииНоменклатуры.ПустаяССылка)
//	|			ТОГДА ЛОЖЬ
//	|		ИНАЧЕ ИСТИНА
//	|	КОНЕЦ КАК СерияУказана,
//	|	ЕСТЬNULL(ВариантыКомплектацииНоменклатуры.Ссылка, ЗНАЧЕНИЕ(Справочник.ВариантыКомплектацииНоменклатуры.ПустаяСсылка)) КАК ВариантКомплектации,
//	|	ВЫБОР
//	|		КОГДА ЕСТЬNULL(ВариантыКомплектацииНоменклатуры.Ссылка, ЗНАЧЕНИЕ(Справочник.ВариантыКомплектацииНоменклатуры.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.ВариантыКомплектацииНоменклатуры.ПустаяСсылка)
//	|			ТОГДА ЛОЖЬ
//	|		ИНАЧЕ ИСТИНА
//	|	КОНЕЦ КАК ВариантКомплектацииУказан,
//	|	ТоварыНаСкладахОбороты.Регистратор КАК ДокументСборки,
//	|	ВЫБОР
//	|		КОГДА ТоварыНаСкладахОбороты.Номенклатура.Родитель = &ГотоваяПродукция
//	|			ТОГДА ИСТИНА
//	|		ИНАЧЕ ЛОЖЬ
//	|	КОНЕЦ КАК ЭтоГотоваяПродукция,
//	|	СУММА(ТоварыНаСкладахОбороты.ВНаличииРасход) КАК Количество
//	|ИЗ
//	|	РегистрНакопления.ТоварыНаСкладах.Обороты(
//	|			&ДатаНачала,
//	|			&ДатаОкончания,
//	|			Регистратор,
//	|			Номенклатура В
//	|				(ВЫБРАТЬ
//	|					ВТТоварыОрганизаций.Номенклатура КАК Номенклатура
//	|				ИЗ
//	|					ВТТоварыОрганизаций КАК ВТТоварыОрганизаций)) КАК ТоварыНаСкладахОбороты
//	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТТоварыОрганизаций КАК ВТТоварыОрганизаций
//	|		ПО ТоварыНаСкладахОбороты.Номенклатура = ВТТоварыОрганизаций.Номенклатура
//	|			И ТоварыНаСкладахОбороты.Регистратор = ВТТоварыОрганизаций.Регистратор
//	|			И (ТоварыНаСкладахОбороты.ВНаличииРасход <> 0)
//	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ВариантыКомплектацииНоменклатуры КАК ВариантыКомплектацииНоменклатуры
//	|		ПО ТоварыНаСкладахОбороты.Номенклатура = ВариантыКомплектацииНоменклатуры.Владелец
//	|			И (ВариантыКомплектацииНоменклатуры.Основной)
//	|			И (НЕ ВариантыКомплектацииНоменклатуры.ПометкаУдаления)
//	|
//	|СГРУППИРОВАТЬ ПО
//	|	ТоварыНаСкладахОбороты.Номенклатура,
//	|	ТоварыНаСкладахОбороты.Серия,
//	|	ТоварыНаСкладахОбороты.Склад,
//	|	ЕСТЬNULL(ВариантыКомплектацииНоменклатуры.Ссылка, ЗНАЧЕНИЕ(Справочник.ВариантыКомплектацииНоменклатуры.ПустаяСсылка)),
//	|	ВЫБОР
//	|		КОГДА ЕСТЬNULL(ВариантыКомплектацииНоменклатуры.Ссылка, ЗНАЧЕНИЕ(Справочник.ВариантыКомплектацииНоменклатуры.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.ВариантыКомплектацииНоменклатуры.ПустаяСсылка)
//	|			ТОГДА ЛОЖЬ
//	|		ИНАЧЕ ИСТИНА
//	|	КОНЕЦ,
//	|	ВЫБОР
//	|		КОГДА ТоварыНаСкладахОбороты.Серия = ЗНАЧЕНИЕ(Справочник.СерииНоменклатуры.ПустаяССылка)
//	|			ТОГДА ЛОЖЬ
//	|		ИНАЧЕ ИСТИНА
//	|	КОНЕЦ,
//	|	ТоварыНаСкладахОбороты.Регистратор,
//	|	ВЫБОР
//	|		КОГДА ТоварыНаСкладахОбороты.Номенклатура.Родитель = &ГотоваяПродукция
//	|			ТОГДА ИСТИНА
//	|		ИНАЧЕ ЛОЖЬ
//	|	КОНЕЦ");
//	
//	Запрос.УстановитьПараметр("ДатаНачала"      , ДатаНачала);
//	Запрос.УстановитьПараметр("ДатаОкончания"   , ДатаОкончания);
//	Запрос.УстановитьПараметр("ГотоваяПродукция", ГотоваяПродукция);
//	Запрос.УстановитьПараметр("СтатьяРасходов"  , СтатьяРасходов);
//	
//	ТабЗатратыНаСборку = Запрос.Выполнить().Выгрузить();
//	
//	ЕстьУзлы = Истина;
//	
//	Пока ЕстьУзлы Цикл
//		ЕстьУзлы = Ложь;
//		
//		///////////////////////////////
//		// разблюдовка по спецификациям
//		Запрос.Текст = ТекстЗапросаРазблюдовкаПоСпецификациям();
//		
//		ТабЗатратыДляРазблюдовки = ТабЗатратыНаСборку.НайтиСтроки(Новый Структура("СерияУказана,ВариантКомплектацииУказан,ЭтоГотоваяПродукция", Ложь, Истина, Ложь));
//		
//		// Номенклатура,Склад,Серия,СерияУказана,ВариантКомплектации,ВариантКомплектацииУказан,ДокументСборки,ЭтоГотоваяПродукция,Количество
//		Пока ТабЗатратыДляРазблюдовки.Количество() > 0 Цикл
//			ВариантыКомплектации = ТабЗатратыНаСборку.ВыгрузитьКолонку("ВариантКомплектации");
//			
//			// запрос в цикле детектед, а куда деваться?
//			Запрос.УстановитьПараметр("ВариантыКомплектации", ВариантыКомплектации);
//			ТабСпецификацииНаСборку = Запрос.Выполнить().Выгрузить();
//			
//			Для Каждого СтрЗатратыДляРазблюдовки Из ТабЗатратыДляРазблюдовки Цикл
//				ТекущаяСпецификация = ТабСпецификацииНаСборку.НайтиСтроки(Новый Структура("Номенклатура", СтрЗатратыДляРазблюдовки.Номенклатура));
//				
//				// добавляем разблюдовку узла в затраты и исключаем узел
//				Для Каждого СтрТекущаяСпецификация Из ТекущаяСпецификация Цикл
//					СтрЗатратыНаСборку = ТабЗатратыНаСборку.Добавить();
//					СтрЗатратыНаСборку.Номенклатура              = СтрТекущаяСпецификация.Комплектующее;
//					СтрЗатратыНаСборку.Склад                     = СтрЗатратыДляРазблюдовки.Склад;
//					СтрЗатратыНаСборку.Серия                     = Справочники.СерииНоменклатуры.ПустаяСсылка();
//					СтрЗатратыНаСборку.СерияУказана              = Ложь;
//					СтрЗатратыНаСборку.ВариантКомплектации       = СтрТекущаяСпецификация.ВариантКомплектации;
//					СтрЗатратыНаСборку.ВариантКомплектацииУказан = СтрТекущаяСпецификация.ВариантКомплектацииУказан;
//					СтрЗатратыНаСборку.ДокументСборки            = СтрЗатратыДляРазблюдовки.ДокументСборки;
//					СтрЗатратыНаСборку.ЭтоГотоваяПродукция       = Ложь;
//					СтрЗатратыНаСборку.Количество                = СтрЗатратыДляРазблюдовки.Количество * СтрТекущаяСпецификация.КоличествоКомплектующих / СтрТекущаяСпецификация.Количество;
//					
//					ЕстьУзлы = Истина;
//				КонецЦикла;
//				
//				ТабЗатратыНаСборку.Удалить(СтрЗатратыДляРазблюдовки);
//			КонецЦикла;
//			
//			// разблюдовываем глубже
//			ТабЗатратыДляРазблюдовки = ТабЗатратыНаСборку.НайтиСтроки(Новый Структура("СерияУказана,ВариантКомплектацииУказан,ЭтоГотоваяПродукция", Ложь, Истина, Ложь));
//		КонецЦикла;
//		
//		////////////////////////
//		// разблюдовка по сериям
//		Запрос.Текст = ТекстЗапросаРазблюдовкаПоСериям();
//		
//		ТабЗатратыДляРазблюдовки = ТабЗатратыНаСборку.НайтиСтроки(Новый Структура("СерияУказана,ЭтоГотоваяПродукция", Истина, Ложь));
//		
//		// Номенклатура,Склад,Серия,СерияУказана,ВариантКомплектации,ВариантКомплектацииУказан,ДокументСборки,ЭтоГотоваяПродукция,Количество
//		Пока ТабЗатратыДляРазблюдовки.Количество() > 0 Цикл
//			ТабСерииНоменклатуры = ТабЗатратыНаСборку.Скопировать(Новый Структура("СерияУказана,ЭтоГотоваяПродукция", Истина, Ложь), "Номенклатура,Серия");
//			
//			// эх...
//			Запрос.УстановитьПараметр("ТЗСерииНоменклатуры", ТабСерииНоменклатуры);
//			ТабСпецификацииНаСборку = Запрос.Выполнить().Выгрузить();
//			
//			Для Каждого СтрЗатратыДляРазблюдовки Из ТабЗатратыДляРазблюдовки Цикл
//				ТекущаяСпецификация = ТабСпецификацииНаСборку.НайтиСтроки(Новый Структура("Номенклатура,Серия", СтрЗатратыДляРазблюдовки.Номенклатура, СтрЗатратыДляРазблюдовки.Серия));
//				
//				// добавляем разблюдовку узла в затраты и исключаем узел
//				Для Каждого СтрТекущаяСпецификация Из ТекущаяСпецификация Цикл
//					СтрЗатратыНаСборку = ТабЗатратыНаСборку.Добавить();
//					СтрЗатратыНаСборку.Номенклатура              = СтрТекущаяСпецификация.Комплектующее;
//					СтрЗатратыНаСборку.Склад                     = СтрЗатратыДляРазблюдовки.Склад;
//					СтрЗатратыНаСборку.Серия                     = СтрТекущаяСпецификация.СерияКомплектующего;
//					СтрЗатратыНаСборку.СерияУказана              = СтрТекущаяСпецификация.СерияУказана;
//					СтрЗатратыНаСборку.ВариантКомплектации       = СтрТекущаяСпецификация.ВариантКомплектации;
//					СтрЗатратыНаСборку.ВариантКомплектацииУказан = СтрТекущаяСпецификация.ВариантКомплектацииУказан;
//					СтрЗатратыНаСборку.ДокументСборки            = СтрЗатратыДляРазблюдовки.ДокументСборки;
//					СтрЗатратыНаСборку.ЭтоГотоваяПродукция       = Ложь;
//					СтрЗатратыНаСборку.Количество                = СтрЗатратыДляРазблюдовки.Количество * СтрТекущаяСпецификация.КоличествоКомплектующих / СтрТекущаяСпецификация.Количество;
//					
//					ЕстьУзлы = Истина;
//				КонецЦикла;
//				
//				ТабЗатратыНаСборку.Удалить(СтрЗатратыДляРазблюдовки);
//			КонецЦикла;
//			
//			// разблюдовываем глубже
//			ТабЗатратыДляРазблюдовки = ТабЗатратыНаСборку.НайтиСтроки(Новый Структура("СерияУказана,ЭтоГотоваяПродукция", Истина, Ложь));
//		КонецЦикла;
//	КонецЦикла; // Пока ЕстьУзлы Цикл
//	
//	ТабЗатратыНаСборку.Свернуть("Номенклатура,Склад, ДокументСборки", "Количество");
//	
//	Возврат ТабЗатратыНаСборку;
//	
//КонецФункции // ПолучитьЗатратыНаСборку()
